[{"title": "Pfizer executive admits COVID-19 vaccine was never tested for transmission prevention"}, {"title": "Coronavirus (COVID-19) Update: FDA Authorizes Moderna and Pfizer-BioNTech Bivalent COVID-19 Vaccines for Use as a Booster Dose in Younger Age Groups"}, {"title": "Pfizer-BioNTech Marauded Moderna Over COVID-19 Vaccine"}, {"title": "Company of the Year 2022: Pfizer – Building on COVID-19 – PharmaLive"}, {"title": "Pfizer and BioNTech Submit Application to U.S. FDA for Emergency Use Authorization of Omicron BA.4/BA.5-Adapted Bivalent Vaccine Booster in Children 5 Through 11 Years of Age"}, {"title": "Pfizer and the U.S. have slimmed down a COVID shot donation deal"}, {"title": "Pfizer Completes Acquisition of Biohaven Pharmaceuticals"}, {"title": "Pfizer or Moderna: Which new omicron-specific Covid booster should you get?"}, {"title": "FDA authorizes Pfizer's COVID-19 booster for ages 5-11"}, {"title": "Here’s What Makes Pfizer (PFE) the Best Stock in Carillon Clarivest Capital Appreciation Fund’s Portfolio"}, {"title": "Royalty Pharma bets Merck's schizophrenia drug can go where Pfizer, Takeda and Lundbeck's couldn't"}, {"title": "Pfizer Omicron boosters available at Ochsner Lafayette General"}, {"title": "Pfizer applies to Swissmedic for authorisation of another COVID-19 vaccine"}, {"title": "Pfizer Completes Acquisition of Global Blood Therapeutics"}, {"title": "NFL season sees Pfizer kick off major Comirnaty COVID vaccine ad offensive for teens, boosters"}, {"title": "Pfizer Leads Big Pharma M&A In 2022 – But Is There More To Come?"}, {"title": "Pfizer CEO tests positive for COVID for a second time"}, {"title": "U.S. cutting global donations of Pfizer COVID shots as demand slows"}, {"title": "Pfizer, BioNTech stocks surge after FDA grants emergency use of BA.4, BA.5 adapted booster shots in children"}, {"title": "EU ignores information request in probe over massive Pfizer COVID-19 vaccine order"}, {"title": "COVID-19 boosters for kids as young as 5 (Pfizer) or 6 (Moderna) approved by FDA: What parents need to know"}, {"title": "FDA authorizes updated Pfizer and Moderna Covid-19 booster shots for children as young as 5"}, {"title": "CytoReason Announces Expanded Collaboration Deal with Pfizer to Deliver AI for Drug Discovery and Development"}, {"title": "Pfizer Stock: Bear Market Conviction Pick (NYSE:PFE)"}, {"title": "Pfizer Announces Positive Top-Line Results from Phase 3 Trial of Pentavalent Meningococcal Vaccine Candidate (MenABCWY) in Adolescents"}, {"title": "Short Volatility Alert: Pfizer Inc. - Pfizer (NYSE:PFE)"}, {"title": "Pfizer Initiates Phase 3 Study of mRNA-Based Influenza Vaccine"}, {"title": "Pfizer Announces Positive Topline Results from Phase 3 TALAPRO-2 Trial"}, {"title": "Pfizer pulls trigger on Voyager gene therapy capsid deal, clearing it to fire TRACER at CNS disease"}, {"title": "EU regulator backs Pfizer/BioNTech BA.4/5-adapted COVID booster"}, {"title": "Pfizer Declares Fourth-Quarter 2022 Dividend"}, {"title": "Moderna v. Pfizer: What the Patent Infringement Suit Means for Biotech"}, {"title": "Pfizer CEO pulls out of testifying to EU Parliament COVID panel"}, {"title": "Brazil approves Pfizer vaccine for children as young as six months"}, {"title": "Migraines vs. Headaches: What's the Difference?"}, {"title": "Top Analyst Reports for NVIDIA, Pfizer & Citigroup"}, {"title": "Could This Be Pfizer's Next Billion-Dollar Vaccine?"}, {"title": "PR firm that represents Pfizer and Moderna also sits on CDC vaccine advisory committee"}, {"title": "NEW: Covid Vaccine Makers Pfizer and Moderna Received US Regulatory Clearance for Their ... - Latest Tweet"}, {"title": "Rebound In COVID-19 Symptoms After Pfizer's Antiviral Pill Might Be Due To Stronger Immune Response"}, {"title": "Pfizer's African Partner Produces First Doses of Covid Shots"}, {"title": "Pfizer-BioNTech Omicron-adapted Booster Dose for Children Gets US Approval"}, {"title": "Months after exiting clinical hold, Pfizer readies to resume dosing in phase 3 gene therapy trial"}, {"title": "Why it's easier to find Pfizer's updated COVID boosters than Moderna's"}, {"title": "Heres why Vinay Rajani is bullish on KIMS, Pfizer; bearish on Nifty"}, {"title": "Global Peptide Therapeutics Market Report 2022: Featuring Pfizer, AstraZeneca, GlaxoSmithKline, Novartis & Amgen - ResearchAndMarkets.com"}, {"title": "Mehul Kothari recommends Buy on CAMS, Pfizer; Check Why"}, {"title": "Schizophrenia Drugs Market Report (2022 to 2030) - H. Lundbeck A/S, Bristol-Myers Squibb Company, Eli Lilly and Company, AstraZeneca plc, Pfizer Inc. and Among Others"}, {"title": "\"Novak Djokovic's decision to not get vaccinated is being vindicated\" - Tennis fans react after Pfizer makers reveal that vaccine was never tested on preventing transmission"}, {"title": "Pfizer Hit With Lawsuit Over Fellowship That Excludes Whites and Asians"}, {"title": "BeiGene touts more Brukinsa-Imbruvica head-to-head win in CLL"}, {"title": "Outlook on the Male Hypogonadism Global Market to 2030 - Featuring Allergan, Pfizer, Bayer and Endo International Among Others"}, {"title": "Vaccine stocks Pfizer, BioNTech, Moderna and Novavax slide after Biden says pandemic is over"}, {"title": "Hot Stocks | RPG Life, Krishna Institute of Medical Sciences, Pfizer can give healthy returns in short..."}, {"title": "Microsoft To $315? Plus Morgan Stanley Sees $50 For Pfizer - DraftKings (NASDAQ:DKNG), American Water Wor"}, {"title": "Pfizer and BioNTech Submit Application to U.S. FDA for Emergency Use Authorization of Omicron BA.4/BA.5-Adapted Bivalent COVID-19 Vaccine"}, {"title": "Pfizer and BioNTech Granted FDA Emergency Use Authorization of Omicron BA.4/BA.5-Adapted Bivalent COVID-19 Vaccine Booster for Ages 12 Years and Older"}, {"title": "Check Out What Whales Are Doing With PFE - Pfizer (NYSE:PFE)"}, {"title": "Pfizer and BioNTech Submit for U.S. Emergency Use Authorization of an Additional Booster Dose of their COVID-19 Vaccine for Older Adults"}, {"title": "Statement from Pfizer Chairman and CEO Albert Bourla on Testing Positive for COVID-19"}, {"title": "Pfizer and BioNTech Announce New Agreement with U.S. Government to Provide Additional Doses of COVID-19 Vaccine"}, {"title": "Pfizer buys COVID diagnostic app developed by Aussie-based Sri Lankan professor"}, {"title": "How Pfizer Won the Pandemic, Reaping Outsize Profit and Influence"}, {"title": "Pfizer to Invest $120 Million to Produce COVID-19 Oral Treatment in the U.S."}, {"title": "Pfizer and BioNTech Announce U.S. FDA Approval of their COVID-19 Vaccine COMIRNATY® For Adolescents 12 through 15 Years of Age"}, {"title": "Pfizer and BioNTech Initiate Rolling Submission for Emergency Use Authorization of Their COVID-19 Vaccine in Children 6 Months Through 4 Years of Age Following Request From U.S. FDA"}, {"title": "Pfizer and BioNTech Advance COVID-19 Vaccine Strategy With Study Start of Next-Generation Vaccine Candidate Based on Enhanced Spike Protein Design"}, {"title": "Pfizer isn't sharing Covid vaccines with researchers for next-gen studies"}, {"title": "Pfizer and BioNTech Provide Update on COVID-19 Vaccine Supply Agreement with European Commission"}, {"title": "Pfizer and BioNTech Granted U.S. Emergency Use Authorization for Booster Dose of Their COVID-19 Vaccine in Children 5 Through 11 Years of Age"}, {"title": "Pfizer and BioNTech Submit Application for U.S. Emergency Use Authorization for a COVID-19 Vaccine Booster Dose in Children 5 Through 11 Years of Age"}, {"title": "Pfizer and BioNTech Announce Omicron-Adapted COVID-19 Vaccine Candidates Demonstrate High Immune Response Against Omicron"}, {"title": "Pfizer and BioNTech Announce Data Demonstrating High Immune Response Following a Booster Dose of their COVID-19 Vaccine in Children 5 Through 11 Years of Age"}, {"title": "Pfizer Reports Additional Data on PAXLOVID™ Supporting Upcoming New Drug Application Submission to U.S. FDA"}, {"title": "An Accord for a Healthier World"}, {"title": "Pfizer-BioNTech COVID-19 Vaccine Receives FDA Emergency Use Authorization for Children 6 Months through 4 Years of Age"}, {"title": "Pfizer-BioNTech COVID-19 Vaccine Demonstrates Strong Immune Response, High Efficacy and Favorable Safety in Children 6 Months to Under 5 Years of Age Following Third Dose"}, {"title": "Pfizer and BioNTech Complete Submission to European Medicines Agency for Omicron BA.1 Adapted Bivalent Vaccine Candidate"}, {"title": "Pfizer and BioNTech Provide Update on Rolling Submission to European Medicines Agency for a Potential Variant-Adapted Vaccine"}, {"title": "Pfizer and BioNTech Provide Update on Ongoing Studies of COVID-19 Vaccine"}, {"title": "Pfizer and BioNTech Receive Expanded U.S. Emergency Use Authorization for an Additional COVID-19 Vaccine Booster in Individuals Aged 50 Years and Older"}, {"title": "Pfizer and BioNTech Initiate Study to Evaluate Omicron-Based COVID-19 Vaccine in Adults 18 to 55 Years of Age"}, {"title": "Pfizer Updates Company Position in Russia"}, {"title": "Pfizer CEO says omicron vaccine will be ready in March"}, {"title": "The Pfizer BioNTech (BNT162b2) COVID-19 vaccine: What you need to know"}, {"title": "Pfizer poised to maintain pandemic sales dominance"}, {"title": "Pfizer Announces Submission of New Drug Application to the U.S. FDA for PAXLOVID™"}, {"title": "Pfizer Vaccine Effective in Children Under 5, the F.D.A. Says"}, {"title": "Pfizer and BioNTech Receive Positive CHMP Opinion for COVID-19 Vaccine Booster in Adolescents 12 through 17 Years of Age in the European Union"}, {"title": "Pfizer and BioNTech Provide Update on Omicron Variant"}, {"title": "COVID-19: Prevention and Treatment Options"}, {"title": "Pfizer Receives U.S. FDA Emergency Use Authorization for Novel COVID-19 Oral Antiviral Treatment"}, {"title": "Pfizer asks FDA to authorize Covid-19 vaccine for youngest kids"}, {"title": "Pfizer and BioNTech Submit a Variation to EMA for the Vaccination of Children 6 Months to less than 5 Years with COMIRNATY®"}, {"title": "US expects shift to commercial COVID market in potential boon to Pfizer"}, {"title": "What's next for Pfizer, Moderna beyond their projected $51 billion in combined Covid vaccine sales this year"}, {"title": "Pfizer and BioNTech start trial of 'next-gen' COVID vaccine"}, {"title": "Pfizer quarterly sales surge to record high, driven by Covid vaccine and antiviral treatment Paxlovid"}, {"title": "Pfizer's Novel COVID-19 Oral Antiviral Treatment Candidate Reduced Risk of Hospitalization or Death by 89% in Interim Analysis of Phase 2/3 EPIC-HR Study"}, {"title": "Pfizer Announces Positive Top-Line Data from Phase 3 Trial of Older Adults for its Bivalent Respiratory Syncytial Virus (RSV) Vaccine Candidate"}]